app/controllers/monitor_controller.rb

SELECT  "readings".* FROM "readings"  ORDER BY "readings"."id" DESC LIMIT 1
---
  def show
    @reading = Reading.last